УНФ_ТЕСТ/src/Catalogs/КП_АвтозапускПроцессов/КП_АвтозапускПроцессов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КП_АвтозапускПроцессов</name>
  <attributes>
    <name>ВидПроцесса</name>
    <type>
      <types>CatalogRef.КП_ВидыПроцессов</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочаяГруппа</name>
    <type>
      <types>CatalogRef.КП_РабочиеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидМетаданных</name>
    <type>
      <types>CatalogRef.КП_СписокМетаданных</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстФункции</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Включено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

УНФ_ТЕСТ/src/Catalogs/КП_АвтозапускПроцессов/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Ключ.Пустая() Тогда
		Объект.ТекстФункции=КП_ОбщееСерверПС.ТекстФункцииСобытияАвтозапускаПроцесса();
		Объект.Ответственный=Пользователи.ТекущийПользователь();
		Объект.Включено=Истина;
	Иначе
		УстановитьОформлениеЭлементов();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидМетаданныхПриИзменении(Элемент)	
	УстановитьНаименование();
КонецПроцедуры

Процедура УстановитьНаименование()
	Если НаименованиеОтредактированоВручную Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаНаименование="";
	
	Если ЗначениеЗаполнено(Объект.ВидМетаданных) Тогда
		СтрокаНаименование="При создании """+СокрЛП(Объект.ВидМетаданных)+"""";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ВидПроцесса) Тогда
		СтрокаНаименование=СтрокаНаименование+?(ПустаяСтрока(СтрокаНаименование), "", " / ")+СокрЛП(Объект.ВидПроцесса);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.РабочаяГруппа) Тогда
		СтрокаНаименование=СтрокаНаименование+?(ПустаяСтрока(СтрокаНаименование), "", " / ")+СокрЛП(Объект.РабочаяГруппа);
	КонецЕсли;
	
	Объект.Наименование=СтрокаНаименование;

КонецПроцедуры

Процедура УстановитьОформлениеЭлементов()
	Если КП_ОбщееСерверПС.ТекстФункцииСобытияПустой(Объект.ТекстФункции) Тогда
		Элементы.СтраницаФункция.Заголовок="Программная функция";
	Иначе
		Элементы.СтраницаФункция.Заголовок="Программная функция (!)";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	УстановитьОформлениеЭлементов();
	ОбновитьПовторноИспользуемыеЗначения();
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияПодробнееНаСайтеНажатие(Элемент)
	КП_ОбщееКлиент.ОткрытьИнтернетАдрес("https://kp-unf.ru/avtozapusk-processov.html");

КонецПроцедуры

&НаКлиенте
Процедура ВидПроцессаПриИзменении(Элемент)
	УстановитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура РабочаяГруппаПриИзменении(Элемент)
	УстановитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	Если ПустаяСтрока(Объект.Наименование) Тогда
		НаименованиеОтредактированоВручную=Ложь;
	Иначе
		НаименованиеОтредактированоВручную=Истина;
	КонецЕсли;
КонецПроцедуры
